---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurveElemLength
source: html/0dcb49c0-8c32-931c-4ec4-ded89c22ef3a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurveElemLength Property

"Length"

## Syntax (C#)
```csharp
public static ForgeTypeId CurveElemLength { get; }
```